# Titanic Dataset

In [1]:
import pandas as pd

In [2]:
#read train dataset
df_train = pd.read_csv("Dataset/train.csv")

In [3]:
#dataset has 891 rows and 12 cols
df_train.shape

(891, 12)

In [4]:
df_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

### Column desc

- `Survived`- Survival	0 = No, 1 = Yes
- `Pclass`- A proxy for socio-economic status (SES) 1st = Upper , 2nd = Middle ,3rd = Lower
- `Name` - Name
- `Sex` - Sex
- `Age` - Age in Years
- `SibSp` - Number of Siblings/Spouses Aboard
- `Parch` -  Number of Parents/Children Aboard
- `Ticket` - Ticket Number
- `Fare` - Passenger Fare
- `Cabin` - Cabin number
- `Embarked` - Port of Embarkation	C = Cherbourg, Q = Queenstown, S = Southampton

In [5]:
#first 5 entries of DataSet
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
#chcking for null values and data type of columns 
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
#null values in columns
df_train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### Facts
- PassengerId,Name,Ticket,Cabin are not needed so we will drop them
- Survived is Target Variable

In [8]:
#Dropping columns 
cols=['PassengerId','Name','Ticket','Cabin']
df_train = df_train.drop(cols,axis=1)

In [9]:
df_train.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked'],
      dtype='object')

In [12]:
#finding number of null values 
df_train.isna().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    2
dtype: int64

In [14]:
#fill missing Age values
df_train['Age']=df_train['Age'].interpolate()

In [16]:
df_train.isna().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    2
dtype: int64

In [20]:
#converting Pclass,Sex,Embarked to dummy variables
#categorical to dummies
dummies = []
cols = ['Pclass', 'Sex', 'Embarked']
for col in cols:
    dummies.append(pd.get_dummies(df_train[col]))

In [21]:
titanic_dummies = pd.concat(dummies, axis=1)

In [22]:
#final dataset
df = pd.concat((df_train,titanic_dummies), axis=1)

In [23]:
#drop orignal comuns from dataset
df = df.drop(['Pclass', 'Sex', 'Embarked'], axis=1)

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Age       891 non-null    float64
 2   SibSp     891 non-null    int64
 3   Parch     891 non-null    int64
 4   Fare      891 non-null    float64
 5   1         891 non-null    uint8
 6   2         891 non-null    uint8
 7   3         891 non-null    uint8
 8   female    891 non-null    uint8
 9   male      891 non-null    uint8
 10  C         891 non-null    uint8
 11  Q         891 non-null    uint8
 12  S         891 non-null    uint8
dtypes: float64(2), int64(3), uint8(8)
memory usage: 41.9 KB

In [26]:
df.sample(5)

     Survived    Age  SibSp  Parch     Fare  1  2  3  female  male  C  Q  S
759         1  33.00      0      0  86.5000  1  0  0       1     0  0  0  1
524         0  42.25      0      0   7.2292  0  0  1       0     1  1  0  0
80          0  22.00      0      0   9.0000  0  0  1       0     1  0  0  1
312         0  26.00      1      1  26.0000  0  1  0       1     0  0  0  1
711         0  36.00      0      0  26.5500  1  0  0       0     1  0  0  1

In [27]:
#seprating out target and factor attributes
X = df.values
y = df['Survived'].values

In [28]:
import numpy as np
X = np.delete(X,1,axis=1)

In [30]:
#dividing into train and test state
from sklearn.model_selection import train_test_split

In [35]:
x_train,x_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=0)